# PathOfTravelViewName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PathOfTravelViewName Property
ParameterTypeId Class See Also
---
"View Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PathOfTravelViewName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathOfTravelViewName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PathOfTravelViewName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace